blog-posts/2005-06-29-really-funky-planner-sorting.org
#+TITLE: Really funky Planner sorting

June 29th, 2005 -
[[http://sachachua.com/blog/p/2797][http://sachachua.com/blog/p/2797]]

The following code sorts completed tasks in reverse-chronological
 order and incomplete tasks in chronological order. This makes it
 easier to see the next action (top of list) and the last action (first
 completed task).

#+BEGIN_EXAMPLE
    (defun sacha/planner-sort-tasks-by-date ()
      "Sort tasks by date, status and priority."
      (skip-chars-forward "#ABC")
      (let ((ch (char-before))
            status)
        (skip-chars-forward "0123456789 ")
        (setq status (char-after))
        (goto-char (line-end-position))
        (skip-chars-backward "]) ")
        (format "%1c%1c%10s"
                (cond
                 ((= status ?o) ?1)
                 ((= status ?X) ?3)
                 ((= status ?C) ?4)
                 (t ?2))
                ch
                (let ((date (or (planner-task-date (planner-current-task-info))
                                planner-sort-undated-tasks-equivalent)))
                  (if (or (= status ?X)
                          (= status ?C))
                      (sacha/planner-invert-date date)
                    date)))))

    (defun sacha/planner-invert-date (date)
      "Reverse the date in the sorting order."
      (mapconcat (lambda (ch)
                   (if (string= ch ".")
                       ch
                     (number-to-string
                      (- 9 (string-to-number ch)))))
                 (split-string date "" t) ""))
#+END_EXAMPLE

[[../emacs/planner-config.el][pos://../emacs/planner-config.el#35188]]

ÃƒÂ£Ã‚Â?Ã‚Â“ÃƒÂ£Ã‚Â?Ã‚Â“ÃƒÂ£Ã‚Â?Ã‚Â®ÃƒÂ£Ã‚ÂƒÃ‚Â‘ÃƒÂ£Ã‚Â‚Ã‚Â½ÃƒÂ£Ã‚Â‚Ã‚Â³ÃƒÂ£Ã‚ÂƒÃ‚Â³ÃƒÂ£Ã‚Â?Ã‚Â¯ÃƒÂ£Ã‚Â‚Ã‚Â·ÃƒÂ£Ã‚Â‚Ã‚Â¹ÃƒÂ£Ã‚ÂƒÃ‚Â†ÃƒÂ£Ã‚ÂƒÃ‚Â
ÃƒÂ£Ã‚Â‚Ã‚Â'ÃƒÂ¥Ã‚Â¤Ã‚Â‰ÃƒÂ£Ã‚Â?Ã‚ÂˆÃƒÂ£Ã‚Â‚Ã‚Â‹ÃƒÂ£Ã‚Â?Ã‚Â“ÃƒÂ£Ã‚Â?Ã‚Â¨ÃƒÂ£Ã‚Â?Ã‚ÂŒÃƒÂ£Ã‚Â?Ã‚Â§ÃƒÂ£Ã‚Â?Ã‚Â?ÃƒÂ£Ã‚Â?Ã‚ÂªÃƒÂ£Ã‚Â?Ã‚Â„ÃƒÂ£Ã‚Â?Ã‚Â®ÃƒÂ£Ã‚Â?Ã‚Â§ÃƒÂ¤Ã‚Â½Ã‚Â•ÃƒÂ£Ã‚Â‚Ã‚Â‚ÃƒÂ£Ã‚Â?Ã‚Â§ÃƒÂ£Ã‚Â?Ã‚Â?ÃƒÂ£Ã‚Â?Ã‚ÂªÃƒÂ£Ã‚Â?Ã‚Â„ÃƒÂ£Ã‚Â€Ã‚Â‚
Because the personal computer here cannot change the system, anything
cannot be done.

On Technorati: [[%20http://www.technorati.com/tag/planner][planner]],
[[http://www.technorati.com/tag/emacs][emacs]],
[[http://www.technorati.com/tag/code][code]]
